# Taps
tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "jandedobbeleer/oh-my-posh"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# Terminal & Shell
brew "zsh-syntax-highlighting"
brew "oh-my-posh"

# Window Management & Status Bar
brew "sketchybar"
cask "aerospace"

# Terminal Emulator
cask "ghostty"

# Editor
brew "neovim"

# Development Tools
brew "git"
brew "gh"
brew "node"
brew "python"
brew "docker"
brew "docker-compose"
brew "awscli"

# Lua (for Neovim configuration)
brew "lua"
brew "luajit"
brew "stylua"
brew "luacheck"

# CLI Tools (commonly used with Neovim)
brew "fzf"
brew "ripgrep"
brew "fd"
brew "jq"
brew "bat"
brew "htop"
brew "tree"
brew "coreutils"
brew "watch"
brew "mas"

# LaTeX
cask "mactex-no-gui"
cask "skim"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# GUI Applications
cask "docker"
cask "arc"
cask "discord"
cask "signal"
cask "zoom"
